# # Pandas Data Frame Creation

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame() #to Create frame syntax

In [3]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [6]:
df1=pd.DataFrame([[1,2,3,4],[5,6,7,8],[46,32,21,90],[8,7,6,5],[4,6,8,10]])

In [7]:
df1

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2  46  32  21  90
3   8   7   6   5
4   4   6   8  10

In [8]:
df1.head(3)

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2  46  32  21  90

In [9]:
df1.tail(3)

    0   1   2   3
2  46  32  21  90
3   8   7   6   5
4   4   6   8  10